; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p9---int100n150-m25---int100c200---s195---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level11 level11)
(sum level0 level14 level14)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level11 level12)
(sum level1 level14 level15)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level11 level13)
(sum level2 level14 level16)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level11 level14)
(sum level3 level14 level17)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level11 level15)
(sum level4 level14 level18)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level11 level16)
(sum level5 level14 level19)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level11 level17)
(sum level6 level14 level20)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level11 level18)
(sum level7 level14 level21)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level11 level19)
(sum level8 level14 level22)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level11 level20)
(sum level9 level14 level23)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level11 level21)
(sum level10 level14 level24)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level11 level22)
(sum level11 level14 level25)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level11 level23)
(sum level12 level14 level26)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level11 level24)
(sum level13 level14 level27)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level11 level25)
(sum level14 level14 level28)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level11 level26)
(sum level15 level14 level29)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level11 level27)
(sum level16 level14 level30)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level11 level28)
(sum level17 level14 level31)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level11 level29)
(sum level18 level14 level32)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level11 level30)
(sum level19 level14 level33)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level11 level31)
(sum level20 level14 level34)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level11 level32)
(sum level21 level14 level35)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level11 level33)
(sum level22 level14 level36)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level11 level34)
(sum level23 level14 level37)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level11 level35)
(sum level24 level14 level38)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level11 level36)
(sum level25 level14 level39)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level11 level37)
(sum level26 level14 level40)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level11 level38)
(sum level27 level14 level41)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level11 level39)
(sum level28 level14 level42)
(sum level28 level22 level50)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level11 level40)
(sum level29 level14 level43)
(sum level29 level22 level51)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level11 level41)
(sum level30 level14 level44)
(sum level30 level22 level52)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level11 level42)
(sum level31 level14 level45)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level11 level43)
(sum level32 level14 level46)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level11 level44)
(sum level33 level14 level47)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level11 level45)
(sum level34 level14 level48)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level11 level46)
(sum level35 level14 level49)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level11 level47)
(sum level36 level14 level50)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level11 level48)
(sum level37 level14 level51)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level11 level49)
(sum level38 level14 level52)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level11 level50)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level11 level51)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level11 level52)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level51 level1 level52)

(connected l0 l1)
(fuelcost level22 l0 l1)
(connected l0 l5)
(fuelcost level3 l0 l5)
(connected l1 l0)
(fuelcost level22 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l1 l4)
(fuelcost level3 l1 l4)
(connected l2 l1)
(fuelcost level25 l2 l1)
(connected l2 l3)
(fuelcost level14 l2 l3)
(connected l2 l4)
(fuelcost level11 l2 l4)
(connected l2 l5)
(fuelcost level1 l2 l5)
(connected l3 l2)
(fuelcost level14 l3 l2)
(connected l3 l5)
(fuelcost level2 l3 l5)
(connected l4 l1)
(fuelcost level3 l4 l1)
(connected l4 l2)
(fuelcost level11 l4 l2)
(connected l4 l5)
(fuelcost level4 l4 l5)
(connected l5 l0)
(fuelcost level3 l5 l0)
(connected l5 l2)
(fuelcost level1 l5 l2)
(connected l5 l3)
(fuelcost level2 l5 l3)
(connected l5 l4)
(fuelcost level4 l5 l4)

(at t0 l2)
(fuel t0 level52)
(= (total-cost) 0)

(at p0 l3)
(at p1 l2)
(at p2 l4)
(at p3 l0)
(at p4 l5)
(at p5 l0)
(at p6 l0)
(at p7 l0)
(at p8 l1)
)

(:goal
(and
(at p0 l5)
(at p1 l5)
(at p2 l3)
(at p3 l2)
(at p4 l3)
(at p5 l5)
(at p6 l1)
(at p7 l4)
(at p8 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 9
2. (drive t0 l2 l5 level51 level1 level52)
   deleted: (at t0 l2) (fuel t0 level52)
   added: (at t0 l5) (fuel t0 level51)
   goals met: 0 of 9
3. (load p4 t0 l5)
   deleted: (at p4 l5)
   added: (in p4 t0)
   goals met: 0 of 9
4. (drive t0 l5 l0 level48 level3 level51)
   deleted: (at t0 l5) (fuel t0 level51)
   added: (at t0 l0) (fuel t0 level48)
   goals met: 0 of 9
5. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 9
6. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 9
7. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 9
8. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 9
9. (drive t0 l0 l1 level26 level22 level48)
   deleted: (at t0 l0) (fuel t0 level48)
   added: (at t0 l1) (fuel t0 level26)
   goals met: 0 of 9
10. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 1 of 9
11. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 1 of 9
12. (drive t0 l1 l4 level23 level3 level26)
   deleted: (at t0 l1) (fuel t0 level26)
   added: (at t0 l4) (fuel t0 level23)
   goals met: 1 of 9
13. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 2 of 9
14. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 2 of 9
15. (drive t0 l4 l2 level12 level11 level23)
   deleted: (at t0 l4) (fuel t0 level23)
   added: (at t0 l2) (fuel t0 level12)
   goals met: 2 of 9
16. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 3 of 9
17. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 4 of 9
18. (drive t0 l2 l5 level11 level1 level12)
   deleted: (at t0 l2) (fuel t0 level12)
   added: (at t0 l5) (fuel t0 level11)
   goals met: 4 of 9
19. (drive t0 l5 l3 level9 level2 level11)
   deleted: (at t0 l5) (fuel t0 level11)
   added: (at t0 l3) (fuel t0 level9)
   goals met: 4 of 9
20. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 4 of 9
21. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 5 of 9
22. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 6 of 9
23. (drive t0 l3 l5 level7 level2 level9)
   deleted: (at t0 l3) (fuel t0 level9)
   added: (at t0 l5) (fuel t0 level7)
   goals met: 6 of 9
24. (unload p0 t0 l5)
   deleted: (in p0 t0)
   added: (at p0 l5)
   goals met: 7 of 9
25. (unload p1 t0 l5)
   deleted: (in p1 t0)
   added: (at p1 l5)
   goals met: 8 of 9
26. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 9 of 9
